---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotAddToOptionsWarn
source: html/78dc43d4-3690-ebcf-1841-20b915b56737.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotAddToOptionsWarn Property

Elements can't be added to Option Set

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAddToOptionsWarn { get; }
```